package ru.job4j;

public class CodePatternsToRemember {
    /** необходимо делить код на блоки выполнения или иные связные вещи
    * разбирать блоки для понимания - что выполняет в какой последовательности
    * пробовать воспроизвести блоки кода по памяти
    *  изучение синтаксиса кода с помощью карточек постановки задачи - решения:
    * пример
    * 1. Базовое выражение <-> numbers = [х for х in numbers].
    * 2. Выражение С выборкой <-> odd numbers = [х for х in numbers if x % 2 == 1].
    * 3. Выражение с вычислением <-> [x*x for x in numbers].
    * 4. Выражение С выборкой И вычислением <-> squares - [x*x for x in numbers if x > 25].
    * Подумайте о 10 концепциях программирования, которые вам трудно запомнить
    * приложений позволяющих создавать свои собственные цифровые карточки Cerego, Anki или Quizlet
    *
    *
    *
    * */

    // объявление инициализация переменных
    int q;
    long b = 99;

    // объявление инициализация массива


    // создание метода

    // создание конструктора

    // циклы for , for each, while, do while, swich - case

    //


    //

    // поиск в массиве пример метода который будет возвращать index по id
    /* private int indexOf(int id) {
        int rsl = -1;
        for (int index = 0; index < size; index++) {
            if (items[index].getId() == id) {
                rsl = index;
                break;
            }
        }
        return rsl;
    }
    */


}
